; domain
(define (domain Depot)
;(:requirements :typing :fluents)
(:types place locatable - object
		depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions 
	(load_limit ?t - truck) 
	(current_load ?t - truck) 
	(weight ?c - crate)
	(fuel-cost)
)
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
		(increase (fuel-cost) 10)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
		(<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
		(increase (current_load ?z) (weight ?y))))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
		(decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob8) (:domain depot)
(:objects
	depot0 - depot
	distributor0 distributor1 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 - pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 - crate
	hoist0 hoist1 hoist2 - hoist)
(:init
	(at pallet0 depot0)
	(clear crate0)
	(at pallet1 distributor0)
	(clear crate6)
	(at pallet2 distributor1)
	(clear crate7)
	(at truck0 distributor0)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 396)
	(at truck1 distributor1)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 277)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 distributor0)
	(available hoist1)
	(at hoist2 distributor1)
	(available hoist2)
	(at crate0 depot0)
	(on crate0 pallet0)
	(= (weight crate0) 29)
	(at crate1 distributor1)
	(on crate1 pallet2)
	(= (weight crate1) 62)
	(at crate2 distributor1)
	(on crate2 crate1)
	(= (weight crate2) 17)
	(at crate3 distributor0)
	(on crate3 pallet1)
	(= (weight crate3) 85)
	(at crate4 distributor1)
	(on crate4 crate2)
	(= (weight crate4) 73)
	(at crate5 distributor1)
	(on crate5 crate4)
	(= (weight crate5) 57)
	(at crate6 distributor0)
	(on crate6 crate3)
	(= (weight crate6) 1)
	(at crate7 distributor1)
	(on crate7 crate5)
	(= (weight crate7) 52)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate0 pallet0)
		(on crate1 pallet2)
		(on crate2 crate1)
		(on crate3 crate0)
		(on crate4 crate2)
		(on crate5 crate3)
	)
)

(:metric minimize (total-time)))

; plan
1. (lift hoist2 crate7 crate5 distributor1)
   deleted: (at crate7 distributor1) (clear crate7) (available hoist2) (on crate7 crate5)
   added: (lifting hoist2 crate7) (clear crate5)
   changed: (fuel-cost) from 0 to 1
   goals met: 4 of 6
2. (load hoist2 crate7 truck1 distributor1)
   deleted: (lifting hoist2 crate7)
   added: (in crate7 truck1) (available hoist2)
   changed: (current_load truck1) from 0 to 52
   goals met: 4 of 6
3. (lift hoist2 crate5 crate4 distributor1)
   deleted: (at crate5 distributor1) (clear crate5) (available hoist2) (on crate5 crate4)
   added: (lifting hoist2 crate5) (clear crate4)
   changed: (fuel-cost) from 1 to 2
   goals met: 4 of 6
4. (load hoist2 crate5 truck1 distributor1)
   deleted: (lifting hoist2 crate5)
   added: (in crate5 truck1) (available hoist2)
   changed: (current_load truck1) from 52 to 109
   goals met: 4 of 6
5. (drive truck1 distributor1 distributor0)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor0)
   changed: (fuel-cost) from 2 to 12
   goals met: 4 of 6
6. (lift hoist1 crate6 crate3 distributor0)
   deleted: (at crate6 distributor0) (clear crate6) (available hoist1) (on crate6 crate3)
   added: (lifting hoist1 crate6) (clear crate3)
   changed: (fuel-cost) from 12 to 13
   goals met: 4 of 6
7. (load hoist1 crate6 truck1 distributor0)
   deleted: (lifting hoist1 crate6)
   added: (in crate6 truck1) (available hoist1)
   changed: (current_load truck1) from 109 to 110
   goals met: 4 of 6
8. (lift hoist1 crate3 pallet1 distributor0)
   deleted: (at crate3 distributor0) (clear crate3) (available hoist1) (on crate3 pallet1)
   added: (lifting hoist1 crate3) (clear pallet1)
   changed: (fuel-cost) from 13 to 14
   goals met: 4 of 6
9. (load hoist1 crate3 truck0 distributor0)
   deleted: (lifting hoist1 crate3)
   added: (in crate3 truck0) (available hoist1)
   changed: (current_load truck0) from 0 to 85
   goals met: 4 of 6
10. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 14 to 24
   goals met: 4 of 6
11. (drive truck1 distributor0 depot0)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot0)
   changed: (fuel-cost) from 24 to 34
   goals met: 4 of 6
12. (unload hoist0 crate3 truck0 depot0)
   deleted: (in crate3 truck0) (available hoist0)
   added: (lifting hoist0 crate3)
   changed: (current_load truck0) from 85 to 0
   goals met: 4 of 6
13. (drop hoist0 crate3 crate0 depot0)
   deleted: (lifting hoist0 crate3) (clear crate0)
   added: (available hoist0) (at crate3 depot0) (clear crate3) (on crate3 crate0)
   goals met: 5 of 6
14. (unload hoist0 crate5 truck1 depot0)
   deleted: (in crate5 truck1) (available hoist0)
   added: (lifting hoist0 crate5)
   changed: (current_load truck1) from 110 to 53
   goals met: 5 of 6
15. (drop hoist0 crate5 crate3 depot0)
   deleted: (lifting hoist0 crate5) (clear crate3)
   added: (available hoist0) (at crate5 depot0) (clear crate5) (on crate5 crate3)
   goals met: 6 of 6
